org-habits.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-07-21 Mon 00:07 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0" />
<title>org habit syntax reference</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="org habit syntax reference">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/newfeather.png">
<meta property="og:url" content="https://notes.neeasade.net/org-habits.html">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=7ca3a7d19d77e07a7aa1b75c41b6c485'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=7ca3a7d19d77e07a7aa1b75c41b6c485'>
<link rel='stylesheet' href='/assets/css/normalize.css?sum=112272e51c80ffe5bd01becd2ce7d656'>
<link rel='stylesheet' href='./assets/css/normalize.css?sum=112272e51c80ffe5bd01becd2ce7d656'>
<link rel='stylesheet' href='/assets/css/magick.css?sum=769ebdb94e66615cccb11826dd3742f6'>
<link rel='stylesheet' href='./assets/css/magick.css?sum=769ebdb94e66615cccb11826dd3742f6'>
<link rel='stylesheet' href='/assets/css/magick-extra.css?sum=f7011cb496789b87a6315975fc8f4a46'>
<link rel='stylesheet' href='./assets/css/magick-extra.css?sum=f7011cb496789b87a6315975fc8f4a46'>
</head>
<body>
<main id="content" class="content">
<header>
<div style="float: left">
    <a href='/index.html'>../ＳＴＸ</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/notes/org-habits.org">source</a>
</div>
<h1 class=title>
    org habit syntax reference
</h1>
<div class="org-center">
<p>

</p>
</div>
</header>
<hr>

<p>
A habit has the following properties:
</p>

<ul class="org-ul">
<li>has TODO</li>
<li>has SCHEDULED:</li>
</ul>

<pre class="example" id="orgddd2433">
\* TODO something
\SCHEDULED: &lt;2020-10-27 Tue ++1w&gt;
</pre>

<ul class="org-ul">
<li>++1w meaning: increase one week after scheduled date (keep increasing by one week until in future), keep day</li>
<li>.+1w meaning: increase one week after NOW, time when marked done</li>
</ul>

<p>
Text from the <a href="https://orgmode.org/manual/Tracking-your-habits.html">manual</a>:
</p>

<ol class="org-ol">
<li>The habit is a TODO item, with a TODO keyword representing an open state.</li>
<li>The property ‘STYLE’ is set to the value ‘habit’ (see Properties and Columns).</li>
<li>The TODO has a scheduled date, usually with a ‘.+’ style repeat interval. A ‘++’ style may be appropriate for habits with time constraints, e.g., must be done on weekends, or a ‘+’ style for an unusual habit that can have a backlog, e.g., weekly reports.</li>
<li>The TODO may also have minimum and maximum ranges specified by using the syntax ‘.+2d/3d’, which says that you want to do the task at least every three days, but at most every two days.</li>
<li>State logging for the DONE state is enabled (see Tracking TODO state changes), in order for historical data to be represented in the consistency graph. If it is not enabled it is not an error, but the consistency graphs are largely meaningless.</li>
</ol>

<p>
NB: number <b>2</b> is what separates a HABIT from a repeating scheduled headline. I think there are some org-agenda implications for &ldquo;consistency feedback&rdquo; if you use that.
</p>
<hr>
</main>
</body>
</html>
